Tekla Open API Reference for Tekla Structures 2025
ComponentInput.AddOneInputPosition Method
 Adds an input position to the component input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddOneInputPosition(
	Point P
)
Public Function AddOneInputPosition (
	P As Point
) As Boolean
Parameters
P
Type: Tekla.Structures.Geometry3d.Point
The position to be added.
Return Value
Type: Boolean
True on success.
See Also
Reference
ComponentInput Class
Tekla.Structures.Model Namespace